snlkuharlocal/src/DataProcessors/ОтбивкаПоНеотработаннымКоррекциям/ОтбивкаПоНеотработаннымКоррекциям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОтбивкаПоНеотработаннымКоррекциям</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/ПисьмаНаОтправку/ПисьмаНаОтправку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПисьмаНаОтправку</name>
  <attributes>
    <name>СписокПолучателей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейКопии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗаписьОтправителя</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемаПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Вложение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаВложения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаСозданияПисьма</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/ПолномочияПользователей/ПолномочияПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПолномочияПользователей</name>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.НастройкиПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Полномочие</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПолномочияПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/InformationRegisters/РеквизитыСправочников/РеквизитыСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыСправочников</name>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Справочник</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СостоянияКоррекции/СостоянияКоррекции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияКоррекции</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Принята</name>
  </enumValues>
  <enumValues>
    <name>ПринятаЧастично</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>Отработана</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/Отгружен/Отгружен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Отгружен</name>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>Резерв</name>
  </enumValues>
  <enumValues>
    <name>РезервТранзит</name>
    <comment>Резерв транзит</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженТранзит</name>
    <comment>Отгружен на транзит</comment>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/DataProcessors/ОтбивкаПоНеотработаннымКоррекциям/ObjectModule.bsl
Процедура Сформировать(ТаблицаПараметров = Неопределено) Экспорт
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	             |	Док.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.КоррекцияРНК КАК Док
	             |ГДЕ
	             |	Док.Дата >= &Дата
	             |	И Док.Проведен
	             |	И Док.ДокОснование.Проведен
	             |	И Док.СостояниеКоррекции = &Утверждена
	             |
	             |ОБЪЕДИНИТЬ ВСЕ
	             |
	             |ВЫБРАТЬ
	             |	Док.Ссылка
	             |ИЗ
	             |	Документ.КоррекцияТоваров КАК Док
	             |ГДЕ
	             |	Док.Дата >= &Дата
	             |	И Док.Проведен
	             |	И Док.ДокОснование.Проведен
	             |	И Док.СостояниеКоррекции = &Утверждена";
	запрос.УстановитьПараметр("Дата",Константы.ДатаЗапретаРедактирования.Получить());
	запрос.УстановитьПараметр("Утверждена",Перечисления.СостоянияКоррекции.Утверждена);	
	//Кухарь 18.12.19 начало
	//Выкидывает в фоновых заданиях с метод не обнаружен следующий()
	//результат = запрос.выполнить().выбрать();	
	//Пока результат.следующий() цикл
	ТЗ=запрос.Выполнить().выгрузить();	
	Для Каждого результат из тз цикл 
	//Кухарь 18.12.19 конец		
		Коррекция=результат.ссылка;
		
		запрос=новый запрос;
		запрос.Текст="ВЫБРАТЬ
		             |	ПисьмаНаОтправку.Основание КАК Основание
		             |ИЗ
		             |	РегистрСведений.ПисьмаНаОтправку КАК ПисьмаНаОтправку
		             |ГДЕ
		             |	ПисьмаНаОтправку.ДатаСозданияПисьма МЕЖДУ &Дата1 И &Дата2
		             |	И ПисьмаНаОтправку.ТемаПисьма ПОДОБНО ""Уведомление об утверждении коррекции""
		             |	И (ПисьмаНаОтправку.Основание = &Коррекция
		             |			ИЛИ ПисьмаНаОтправку.Основание = ""Универсальная обработка коррекций пакет созданный""
		             |				И ПисьмаНаОтправку.ТекстПисьма ПОДОБНО &НомерКоррекции)";
		//Кухарь 23.12.19 начало
		//Отбивка по коррекциям утверждённым более чем 2 часа назад
		//запрос.УстановитьПараметр("Сегодня",НачалоДня(ТекущаяДата()));
		//запрос.УстановитьПараметр("ПустаяДата",ПустаяДата());
		запрос.УстановитьПараметр("Дата1",НачалоДня(ТекущаяДата()));

		// Кухарь А.Ю. 09.02.2021 начало
		// 		запрос.УстановитьПараметр("Дата2",ТекущаяДата()-2*3600);
		запрос.УстановитьПараметр("Дата2",ТекущаяДата());		 
		// Кухарь А.Ю. 09.02.2021 конец
		
		//Кухарь 23.12.19 конец

		запрос.УстановитьПараметр("Коррекция",Коррекция);
		запрос.УстановитьПараметр("НомерКоррекции","%"+Коррекция.номер+"%");
		результат=запрос.Выполнить().Выгрузить();
		если результат.Количество()>0 тогда
			Продолжить;
		КонецЕсли;
		
		СформироватьУведомление(Коррекция);
	КонецЦикла;
	
КонецПроцедуры



//Кухарь 10.01.19 начало
//Создание записей в РС ПисьмаНаОтправку
Процедура СформироватьУведомление(Коррекция) экспорт
	если ложь тогда Коррекция=Документы.КоррекцияРНК.ПустаяСсылка();КонецЕсли;
	
	СписокПолучателей=новый СписокЗначений;
	ТемаПисьма="Повторное уведомление об отработке";
	
	Согласования=Коррекция.Согласования;
	ТипКоррекции=Коррекция.метаданные().имя;
	Автор=Коррекция.Автор;
	Номер=Коррекция.Номер;
	ДокОснование=Коррекция.ДокОснование;
	ТипДокОснования=ДокОснование.метаданные().имя;
	если ТипДокОснования="ЗаявкаВТранспортныйОтдел" тогда
		Отправитель=ДокОснование.Отправитель;
		Получатель=ДокОснование.Получатель;
	КонецЕсли;
	
	если Коррекция.ДокОснование.Метаданные().Имя="РасходнаяНакладная" тогда
		ТекстКонтрагента=" по контрагенту "+ДокОснование.Контрагент.Наименование;
	иначе
		ТекстКонтрагента="";
	КонецЕсли;
	
	ТекстПисьма="Просьба не забыть отработать коррекцию "+Номер+ТекстКонтрагента;
	
	если ТипКоррекции="КоррекцияТоваров" тогда
		ТекстПисьма=СтрЗаменить(ТекстПисьма," коррекцию "," коррекцию по товарам ");
	КонецЕсли;
	
	//Михайловский С. 20220712 -придется так+++
	МИскл=Новый Массив;
	МИскл.Добавить("krohin@collant.ru");
	МИскл.Добавить("kuhar@collant.ru");
	//Михайловский С. 20220712 -придется так---
	СписокПолномочий=новый СписокЗначений;
	//Михайловский С. 20220718 -коррекция по полномочиям+++
	СтрТЧ=Согласования.Найти(Справочники.Подразделения.НайтиПоКоду("SSP-0145"));	
	ДопСписок1=СформСписокПолучат(Справочники.ТипыРассылок.ПовторноеУведомлениеОбОбработке,Справочники.Подразделения.НайтиПоКоду("SSP-0145"));
	ДопСписок2=СформСписокПолучат(Справочники.ТипыРассылок.ПовторноеУведомлениеОбОбработке,Справочники.Подразделения.НайтиПоКоду("SMN-0434"));
	ДопСписок3=СформСписокПолучат(Справочники.ТипыРассылок.ПовторноеУведомлениеОбОбработке,Справочники.Подразделения.НайтиПоКоду("SMN-0436"));
	если СтрТЧ<>Неопределено и не СтрТЧ.Согласовано тогда  //Претензионно-ревизионный отдел
				
		
		Если ДопСписок1.Количество() Тогда
			Для Каждого ТЭл ИЗ ДопСписок1 Цикл
				СписокПолучателей.Добавить(ТЭл.Значение);
			КонецЦикла;	
		Иначе
			СписокПолномочий.Добавить(ПланыВидовХарактеристик.ПолномочияПользователей.ДокументКоррекцияОбработка);
		КонецЕсли;	
		
	КонецЕсли;	
	
	СтрТЧ=Согласования.Найти(Справочники.Подразделения.НайтиПоКоду("SMN-0434"));	
	если СтрТЧ<>Неопределено и не СтрТЧ.Согласовано  тогда   //ОВЛ
		
		Если ДопСписок2.Количество() Тогда
			Для Каждого ТЭл ИЗ ДопСписок2 Цикл
				СписокПолучателей.Добавить(ТЭл.Значение);
			КонецЦикла;	
		Иначе
			СписокПолномочий.Добавить(ПланыВидовХарактеристик.ПолномочияПользователей.ДокументКоррекцияОбработкаОВЛ);
		КонецЕсли;
		
	КонецЕсли;		
	
	СтрТЧ=Согласования.Найти(Справочники.Подразделения.НайтиПоКоду("SMN-0436"));	
	если СтрТЧ<>Неопределено  и не СтрТЧ.Согласовано  тогда  //Складской Комплекс Общие
		
		Если ДопСписок3.Количество() Тогда
			Для Каждого ТЭл ИЗ ДопСписок3 Цикл
				СписокПолучателей.Добавить(ТЭл.Значение);
			КонецЦикла;	
		Иначе
			СписокПолномочий.Добавить(ПланыВидовХарактеристик.ПолномочияПользователей.ДокументКоррекцияОбработкаСК);
		КонецЕсли;
		
		
	КонецЕсли;	
	Если НЕ ДопСписок1.Количество() И НЕ ДопСписок2.Количество() И НЕ ДопСписок3.Количество() Тогда
		Запрос=новый запрос;
		запрос.Текст= "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(ПолномочияПользователей.Пользователь.ФизЛицо.ЕМэйл КАК СТРОКА(100)) КАК Почта,
		|	ПолномочияПользователей.Полномочие
		|ИЗ
		|	РегистрСведений.ПолномочияПользователей КАК ПолномочияПользователей
		|ГДЕ
		|	ПолномочияПользователей.Полномочие В(&СписокПолномочий)
		|	И ПолномочияПользователей.Значение = ИСТИНА";
		запрос.УстановитьПараметр("СписокПолномочий",СписокПолномочий);
		//Кухарь 18.12.19 начало
		//Выкидывает в фоновых заданиях с метод не обнаружен следующий()
		//результат = запрос.выполнить().выбрать();	
		//Пока результат.следующий() цикл
		ТЗ=запрос.Выполнить().выгрузить();	
		Для Каждого результат из тз цикл 
			//Кухарь 18.12.19 конец	
			если Найти(результат.Почта,"@")>0 тогда
				//Михайловский С. 20220712 -придется так+++
				//вместо
				//СписокПолучателей.Добавить(СокрЛП(результат.Почта));
				Если МИскл.Найти(СокрЛП(результат.Почта))=неопределено Тогда
					СписокПолучателей.Добавить(СокрЛП(результат.Почта));
				КонецЕсли;	
				//Михайловский С. 20220712 -придется так---
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	
	//Михайловский С. 20220718 -изменения по полномочиям---
	
	если Найти(автор.ФизЛицо.ЕМэйл,"@")>0 тогда
		СписокПолучателей.Добавить(СокрЛП(автор.ФизЛицо.ЕМэйл));
	КонецЕсли;
	
	если Найти(ДокОснование.Менеджер.ЕМэйл,"@")>0 тогда
		СписокПолучателей.Добавить(СокрЛП(ДокОснование.Менеджер.ЕМэйл));
	КонецЕсли;


	если СокрЛП(ТекстПисьма="") тогда
		ЗаписатьВЛог("Регламент","Пустой текст при формировании письма к коррекции № "+Номер,"Ошибка");		
	ИначеЕсли СписокПолучателей.Количество()=0 тогда
		ЗаписатьВЛог("Регламент","Пустой список адресатов при формировании письма к коррекции № "+Номер,"Ошибка");
	иначе
		//Кухарь 15.01.19 начало
		тз=новый ТаблицаЗначений;
		тз.Колонки.Добавить("Склад");
		тз.Колонки.Добавить("ГруппыТоваров");
		тз.Колонки.Добавить("Номер");
		тз.Колонки.Добавить("СостояниеНакладной");
		тз.Колонки.Добавить("ДатаОтгрузки");
		тз.Колонки.Добавить("Получатель");
		тз.Колонки.Добавить("ТипДоставки");
		тз.Колонки.Добавить("ПунктДоставки");
		тз.Колонки.Добавить("КоличествоДокумента");
		тз.Колонки.Добавить("Объем");
		тз.Колонки.Добавить("АвторКоррекции");
		тз.Колонки.Добавить("ИзменяемыеРеквизитыНакладной");
		тз.Колонки.Добавить("ТекущееЗначение");
		тз.Колонки.Добавить("НовоеЗначение");
		тз.Колонки.Добавить("Накладная");
		
		СтрТЗ=тз.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТЗ,ДокОснование);
		если ДокОснование.ОбъемКоробов >0 тогда
			СтрТЗ.Объем=ДокОснование.ОбъемКоробов;
		иначе
			СтрТЗ.Объем=ДокОснование.ОбъемДокумента;
		КонецЕсли;
		СтрТЗ.Накладная=ДокОснование;
		СтрТЗ.АвторКОррекции=автор;

		
		если ДокОснование.метаданные().имя<>"ЗаявкаВТранспортныйОтдел" тогда
			СтрТЗ.Получатель=?(ДокОснование.метаданные().имя="Перемещение",ДокОснование.СкладПолучатель,ДокОснование.Контрагент);
		иначе
			СтрТЗ.Получатель=?(типзнч(отправитель)=тип("СправочникСсылка.Контрагенты"),Отправитель,Получатель);
		КонецЕсли;
		
		если ТипКоррекции<>"КоррекцияТоваров" тогда			
			ТЗИзменений=новый ТаблицаЗначений;
			ТЗИзменений.Колонки.Добавить("ИмяРеквизита");
			ТЗИзменений.Колонки.Добавить("СинонимРеквизита");
			ТЗИзменений.Колонки.Добавить("ДоИзменения");
			ТЗИзменений.Колонки.Добавить("ПослеИзменения");
			ТЗИзменений.Колонки.Добавить("ВНакладной");
			ТЗИзменений.Колонки.Добавить("Накладная");	
			ТЗРеквизитов=ПолучитьТЗДоступныхКИзменениюРеквизитов(Коррекция);	
			для каждого ТекРеквизит из  ТЗРеквизитов цикл
				ИмяИзменяемогоРеквизит=Коррекция.Метаданные().Реквизиты.Найти(ТекРеквизит.ИмяРеквизита+"ДоИзменения");	
				если ИмяИзменяемогоРеквизит=Неопределено тогда Продолжить;КонецЕсли;
				ЗначениеИзменяемогоРеквизита=Коррекция[ИмяИзменяемогоРеквизит.имя];
				ЗначениеТекущегоРеквизита=Коррекция[ТекРеквизит.ИмяРеквизита];	
				если ЗначениеИзменяемогоРеквизита<>ЗначениеТекущегоРеквизита тогда
					СтрТЧ=ТЗИзменений.Добавить();
					СтрТЧ.ИмяРеквизита=ТекРеквизит.ИмяРеквизита;
					СтрТЧ.СинонимРеквизита=Коррекция.Метаданные().Реквизиты.Найти(ТекРеквизит.ИмяРеквизита).синоним;
					СтрТЧ.ДоИзменения=ЗначениеИзменяемогоРеквизита;
					СтрТЧ.ПослеИзменения=ЗначениеТекущегоРеквизита;
					СтрТЧ.ВНакладной=ДокОснование[ТекРеквизит.ИмяРеквизита];	
					СтрТЧ.Накладная=ДокОснование;
					если СтрТЧ.ИмяРеквизита="ПунктДоставки" тогда
					//Кухарь 02.04.20 начало
					//+ изменения в доп. печати
					если СтрТЧ.ДоИзменения.ПечГрузополучательТорг12<>СтрТЧ.ПослеИзменения.ПечГрузополучательТорг12 тогда
						СтрТЧ2=ТЗИзменений.Добавить();
						ЗаполнитьЗначенияСвойств(СтрТЧ2,СтрТЧ);	
						СтрТЧ2.ДоИзменения=СтрТЧ2.ДоИзменения.ПечГрузополучательТорг12;
						СтрТЧ2.ВНакладной=СтрТЧ2.ВНакладной.ПечГрузополучательТорг12;	
						СтрТЧ2.ПослеИзменения=СтрТЧ2.ПослеИзменения.ПечГрузополучательТорг12;	
						СтрТЧ2.ИмяРеквизита="Грузополучатель торг12 из доп. печати";
						СтрТЧ2.СинонимРеквизита="Грузополучатель торг12 из доп. печати";
					КонецЕсли;
					
					если СтрТЧ.ДоИзменения.ПечГрузополучательСФ<>СтрТЧ.ПослеИзменения.ПечГрузополучательСФ тогда
						СтрТЧ2=ТЗИзменений.Добавить();
						ЗаполнитьЗначенияСвойств(СтрТЧ2,СтрТЧ);	
						СтрТЧ2.ДоИзменения=СтрТЧ2.ДоИзменения.ПечГрузополучательСФ;
						СтрТЧ2.ВНакладной=СтрТЧ2.ВНакладной.ПечГрузополучательСФ;	
						СтрТЧ2.ПослеИзменения=СтрТЧ2.ПослеИзменения.ПечГрузополучательСФ;	
						СтрТЧ2.ИмяРеквизита="Грузополучатель СФ из доп. печати";
						СтрТЧ2.СинонимРеквизита="Грузополучатель СФ из доп. печати";
					КонецЕсли;			                  
					//Кухарь 02.04.20 конец
						
						
						СтрТЧ.ДоИзменения=Строка(СтрТЧ.ДоИзменения)+"; Адрес: "+СтрТЧ.ДоИзменения.ПочтовыйАдрес;
						СтрТЧ.ПослеИзменения=Строка(СтрТЧ.ПослеИзменения)+"; Адрес: "+СтрТЧ.ПослеИзменения.ПочтовыйАдрес;
					КонецЕсли;
				КонецЕсли;	
			КонецЦикла;
		иначе
			ТЗИзменений=новый ТаблицаЗначений;		
			ТЗИзменений.Колонки.Добавить("Реквизит");
			ТЗИзменений.Колонки.Добавить("ДоИзменения");
			ТЗИзменений.Колонки.Добавить("ПослеИзменения");
			если Коррекция.ОбъемДокумента<>Коррекция.ОбъемДокументаДоИзменения тогда
				СтрТЗ=ТЗИзменений.Добавить();
				СтрТЗ.Реквизит="Объём номенклатуры";
				СтрТЗ.ДоИзменения=Коррекция.ОбъемДокументаДоИзменения;
				СтрТЗ.ПослеИзменения=Коррекция.ОбъемДокумента;	
			КонецЕсли;
			если Коррекция.СуммаДокумента<>Коррекция.СуммаДокументаДоИзменения тогда
				СтрТЗ=ТЗИзменений.Добавить();
				СтрТЗ.Реквизит="Сумма документа";
				СтрТЗ.ДоИзменения=Коррекция.СуммаДокументаДоИзменения;
				СтрТЗ.ПослеИзменения=Коррекция.СуммаДокумента;	
			КонецЕсли;
			если Коррекция.КоличествоДокумента<>Коррекция.КоличествоДокументаДоИзменения тогда
				СтрТЗ=ТЗИзменений.Добавить();
				СтрТЗ.Реквизит="Количество";
				СтрТЗ.ДоИзменения=Коррекция.КоличествоДокументаДоИзменения;
				СтрТЗ.ПослеИзменения=Коррекция.КоличествоДокумента;	
			КонецЕсли;			
		КонецЕсли;
		ХТМЛТекст=ПреобразоватьТаблицуВHTMLText(тз,ТекстПисьма,ТЗИзменений,Коррекция);
		ТекстПисьма=ХТМЛТекст;
		//Михайловский С. 20220712 -дополнительно+++
		ДопСписок=СформСписокПолучат(Справочники.ТипыРассылок.ПовторноеУведомлениеОбОбработке);
		Если ДопСписок.Количество() Тогда
			Для Каждого ТЭл ИЗ ДопСписок Цикл
				СписокПолучателей.Добавить(ТЭл.Значение);
			КонецЦикла;	
		КонецЕсли;	
		//Михайловский С. 20220712 -дополнительно---
		ПодготовитьПисьмоКОтправке (СписокПолучателей,ТекстПисьма,ТемаПисьма,Коррекция);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьПисьмоКОтправке (СписокПолучателей,ТекстПисьма,ТемаПисьма,Ссылка)
	СписокАдресов="";
	для каждого Стр из СписокПолучателей цикл
		если Найти(СписокАдресов,Стр.Значение)=0 тогда
			СписокАдресов=СписокАдресов+Стр.Значение+"##";
		КонецЕсли;
	КонецЦикла;
	СписокАдресов=лев(СписокАдресов,СтрДлина(СписокАдресов)-2);
	
	
	ЗаписьВРег=РегистрыСведений.ПисьмаНаОтправку.СоздатьМенеджерЗаписи();
	//Кухарь 15.01.19 начало	
	//ЗаписьВРег.Основание=Метаданные().Синоним+" "+Номер;
	ЗаписьВРег.Основание=Ссылка;
	//Кухарь 15.01.19 конец		
	ЗаписьВРег.ДатаСозданияПисьма=ТекущаяДата();
	ЗаписьВРег.период=ЗаписьВРег.ДатаСозданияПисьма;
	
	ЗаписьВРег.ТекстПисьма=ТекстПисьма;
	ЗаписьВРег.ТемаПисьма=ТемаПисьма;
	ЗаписьВРег.СписокПолучателей=СписокАдресов;
	ЗаписьВРег.Записать();		
КонецПроцедуры
//Кухарь 10.01.19 конец


//Кухарь 15.01.19 начало
Функция ПреобразоватьТаблицуВHTMLText(ТЗ,ДопТекст,ТЗИзменений,Коррекция)
	если Коррекция.метаданные().имя<>"КоррекцияТоваров" тогда		
		р = 3;
		Ответ = "<HTML><HEAD><BODY>"+ДопТекст+"<TABLE border=1><TBODY>";	
		Ответ=Ответ+"<TR bgcolor=#FFFF99>";	
		Ответ=Ответ+"<TD><P><FONT size=3> Склад </FONT></TD>";
		Ответ=Ответ+"<TD><P><FONT size=3> Группа товаров </FONT></TD>";
		Ответ=Ответ+"<TD><P><FONT size=3> Номер </FONT></TD>";	
		Ответ=Ответ+"<TD><P><FONT size=3> Состояние накладной </FONT></TD>";
		Ответ=Ответ+"<TD><P><FONT size=3> Дата отгрузки </FONT></TD>";
		Ответ=Ответ+"<TD><P><FONT size=3> Получатель </FONT></TD>";
		Ответ=Ответ+"<TD><P><FONT size=3> Тип доставки </FONT></TD>";
		Ответ=Ответ+"<TD><P><FONT size=3> Пункт доставки </FONT></TD>";
		Ответ=Ответ+"<TD><P><FONT size=3> Кол-во </FONT></TD>";
		Ответ=Ответ+"<TD><P><FONT size=3> Объем </FONT></TD>";
		Ответ=Ответ+"<TD><P><FONT size=3> Автор корреции </FONT></TD>";
		Ответ=Ответ+"<TD><P><FONT size=3> Изменяемые реквизиты </FONT></TD>";
		Ответ=Ответ+"<TD><P><FONT size=3> Текущее значение </FONT></TD>";
		Ответ=Ответ+"<TD><P><FONT size=3> Новое значение </FONT></TD>";
		Ответ=Ответ+"</TR>";		
		для каждого СтрокаТаблицы из ТЗ	цикл
			Ответ=Ответ+"<TR>";
			для каждого Колонка из ТЗ.колонки цикл
				если Колонка.имя="Накладная" тогда Прервать;КонецЕсли;
				Ответ=Ответ+"<TD><P><FONT size=3>"+СтрокаТаблицы[Колонка.имя]+"</FONT></P></TD>";
			КонецЦикла;
			Ответ=Ответ+"</TR>";					
			МассСтрок=ТЗИзменений.НайтиСтроки(новый Структура("Накладная",СтрокаТаблицы.Накладная));
			если МассСтрок.количество()>0 тогда
				для каждого СтрМассива из МассСтрок цикл
					Ответ=Ответ+"<TR>";					
					для сч=1 по 11 цикл 
						Ответ=Ответ+"<TD><P><FONT size=3>"+""+"</FONT></P></TD>";
					КонецЦикла;				
					Ответ=Ответ+"<TD><P><FONT size=3>"+СтрМассива.СинонимРеквизита+"</FONT></P></TD>";
					Ответ=Ответ+"<TD><P><FONT size=3>"+СтрМассива.ДоИзменения+"</FONT></P></TD>";
					Ответ=Ответ+"<TD><P><FONT size=3>"+СтрМассива.ПослеИзменения+"</FONT></P></TD>";				
					Ответ=Ответ+"</TR>";				
				КонецЦикла;			
			КонецЕсли;
		КонецЦикла;		
		Ответ  =Ответ+"</TBODY></TABLE></BODY></HTML>";
		Возврат Ответ;
	иначе
		Ответ = "<HTML><HEAD><BODY>"+ДопТекст+"<TABLE border=1><TBODY>";	
		Ответ=Ответ+"<TR bgcolor=#FFFF99>";	
		Ответ=Ответ+"<TD><P><FONT size=3> Изменяемые реквизиты </FONT></TD>";
		Ответ=Ответ+"<TD><P><FONT size=3> Старое значение </FONT></TD>";
		Ответ=Ответ+"<TD><P><FONT size=3> Новое значение </FONT></TD>";
		Ответ=Ответ+"</TR>";		
		для каждого СтрокаТаблицы из ТЗИзменений	цикл
			Ответ=Ответ+"<TR>";			
			Ответ=Ответ+"<TD><P><FONT size=3>"+СтрокаТаблицы.Реквизит+"</FONT></P></TD>";
			Ответ=Ответ+"<TD><P><FONT size=3>"+СтрокаТаблицы.ДоИзменения+"</FONT></P></TD>";
			Ответ=Ответ+"<TD><P><FONT size=3>"+СтрокаТаблицы.ПослеИзменения+"</FONT></P></TD>";		
			Ответ=Ответ+"</TR>";	
		КонецЦикла;				
		Ответ  =Ответ+"</TBODY></TABLE></BODY></HTML>";
		Возврат Ответ;	
	КонецЕсли;
КонецФункции
//Кухарь 15.01.19 конец


Функция ПолучитьТЗДоступныхКИзменениюРеквизитов (Коррекция) экспорт
	ТЗКонечная=новый ТаблицаЗначений;
	ТЗКонечная.Колонки.Добавить("ИмяРеквизита");
	ТЗРеквизитов=ПолучитьРаспределениеРеквизитовПоПолномочиям(Коррекция);

	МассСтрок=ТЗРеквизитов.найтистроки(Новый Структура("ПРО",Истина));
	Для каждого СтрМасс из МассСтрок цикл
		СтрТЗ=ТЗКонечная.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТЗ,СтрМасс);
	КонецЦикла;


		МассСтрок=ТЗРеквизитов.найтистроки(Новый Структура("ЦО",Истина));
		Для каждого СтрМасс из МассСтрок цикл
			СтрТЗ=ТЗКонечная.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТЗ,СтрМасс);
		КонецЦикла;
	

		МассСтрок=ТЗРеквизитов.найтистроки(Новый Структура("ОВЛ",Истина));
		Для каждого СтрМасс из МассСтрок цикл
			СтрТЗ=ТЗКонечная.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТЗ,СтрМасс);
		КонецЦикла;	

		МассСтрок=ТЗРеквизитов.найтистроки(Новый Структура("СК",Истина));
		Для каждого СтрМасс из МассСтрок цикл
			СтрТЗ=ТЗКонечная.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТЗ,СтрМасс);
		КонецЦикла;

	
	ТЗКонечная.Свернуть("ИмяРеквизита");
	Возврат ТЗКонечная;
КонецФункции



Функция ПолучитьПризнакПропускаемогоВКоррекцииРеквизита (ИмяРеквизита,Коррекция) экспорт
ДокОснование=Коррекция.ДокОснование;	
	//Кухарь 07.08.19 начало
	//Коррекции к ЗТО
	если ДокОснование.Метаданные().Имя="ЗаявкаВТранспортныйОтдел" тогда
		если ИмяРеквизита<>"Отправитель" и
			ИмяРеквизита<>"ПунктДоставкиОтправитель" и
			ИмяРеквизита<>"ТранспортнаяКомпанияОтправитель" и
			ИмяРеквизита<>"ПунктПерегрузаОтправитель" и
			ИмяРеквизита<>"ПунктДоставкиПолучатель" и
			ИмяРеквизита<>"ТранспортнаяКомпанияПолучатель" и
			ИмяРеквизита<>"Подразделение" и
			ИмяРеквизита<>"Менеджер" и
			ИмяРеквизита<>"ДатаПриемки" и
			ИмяРеквизита<>"ОбъемКоробов" и
			ИмяРеквизита<>"КоличествоКоробок" и
			ИмяРеквизита<>"КоличествоДокумента" и
			ИмяРеквизита<>"Содержание" и
			ИмяРеквизита<>"ДатаОтгрузки" тогда
			Возврат Истина
		иначе
			возврат ложь;
		КонецЕсли;
	КонецЕсли;
	//Кухарь 07.08.19 конец	
	
	//Кухарь 25.04.19 начало
	если ДокОснование.Метаданные().Имя="Перемещение" и не ЕстьРеквизитДокумента(ИмяРеквизита,ДокОснование.Метаданные()) тогда
		Возврат Истина;
	КонецЕсли;
		//Кухарь 25.04.19 конец
	
	
	если ИмяРеквизита="Автор" или
		ИмяРеквизита="Валюта" или
		ИмяРеквизита="ДатаОформления" или
		ИмяРеквизита="ИБ" или
		ИмяРеквизита="Курс" или
		//ИмяРеквизита="Организация" или
		ИмяРеквизита="Склад" или
		//ИмяРеквизита="ТипЦен" или
		ИмяРеквизита="СостояниеНакладной" или
		//ИмяРеквизита="Скидка" или
		ИмяРеквизита="БанковскийСчет" или
		ИмяРеквизита="Отгружен" или
		ИмяРеквизита="ГруппыТоваров" или
		//ИмяРеквизита="ТипСкидок" или
		ИмяРеквизита="ДокОснование" или
		ИмяРеквизита="КоличествоДокумента" или	
		ИмяРеквизита="Регион" или	
		ИмяРеквизита="ОбъемКоробов" или
		//ИмяРеквизита="ТипЦенРаспродажа" или
		ИмяРеквизита="РайонДоставки" или
		ИмяРеквизита="КоличествоКоробок" или
		ИмяРеквизита="ДопСкидкаНаНакладную" или
		ИмяРеквизита="КодОперации" или
		ИмяРеквизита="неКонтролироватьДублиСтрок" или
		ИмяРеквизита="НулеваяСтавкаНДС" или
		ИмяРеквизита="Согласована" или
		ИмяРеквизита="Отработана" или
		ИмяРеквизита="СостояниеКоррекции" или
		ИмяРеквизита="Утвердил" или
		ИмяРеквизита="Отработал" или
		ИмяРеквизита="СтрокаИзменений" или
		ИмяРеквизита="ГТ" или
		ИмяРеквизита="ГТД" или
		ИмяРеквизита="БухгалтерскаяКоррекция" или
		ИмяРеквизита="Партия" или
		ИмяРеквизита="НомерТОРГ12Входящий" или
		//Кухарь 18.02.19 начало
		ИмяРеквизита="ТипЦен" или
		//Кухарь 18.02.19 конец	
		ИмяРеквизита="НомерСФВходящий" или
		ИмяРеквизита="ДатаВходящихДокументов" тогда

		возврат Истина;
	иначе
		возврат ложь;
	КонецЕсли;
КонецФункции

Функция ПолучитьРаспределениеРеквизитовПоПолномочиям (Коррекция)  экспорт
	ДокОснование=Коррекция.ДокОснование;
	Согласования=Коррекция.Согласования;
	ТипДокумента=ДокОснование.Метаданные().Имя;	
	если ТипДокумента="РасходнаяНакладная" или ТипДокумента="Перемещение" тогда
		СостояниеДокумента=ДокОснование.Отгружен;	
	иначе
		СостояниеДокумента=Перечисления.Отгружен.Резерв;
	КонецЕсли;	
	ТЗРаспределения=новый ТаблицаЗначений;
	ТЗРаспределения.Колонки.Добавить("ИмяРеквизита");
	ТЗРаспределения.Колонки.Добавить("ЦО");
	ТЗРаспределения.Колонки.Добавить("СК");
	ТЗРаспределения.Колонки.Добавить("ОВЛ");
	ТЗРаспределения.Колонки.Добавить("ПРО");
	КоррекцияОбъект=коррекция.получитьобъект();
	
	для каждого ТекРеквизит из  Коррекция.Метаданные().Реквизиты цикл
		если ПолучитьПризнакПропускаемогоВКоррекцииРеквизита(ТекРеквизит.Имя,Коррекция) тогда
			Продолжить;
		КонецЕсли;		
		ИмяИзменяемогоРеквизит=Коррекция.Метаданные().Реквизиты.Найти(ТекРеквизит.Имя+"ДоИзменения");	
		если ИмяИзменяемогоРеквизит=Неопределено тогда Продолжить;КонецЕсли;
		ЗначениеИзменяемогоРеквизита=Коррекция[ИмяИзменяемогоРеквизит.имя];
		ЗначениеТекущегоРеквизита=Коррекция[ТекРеквизит.имя];
		
		если ЗначениеИзменяемогоРеквизита=ЗначениеТекущегоРеквизита тогда Продолжить;КонецЕсли;
		
		СтрТЧ=ТЗРаспределения.Добавить();
		СтрТЧ.ЦО=ложь;
		СтрТЧ.СК=ложь;
		СтрТЧ.ОВЛ=ложь;
		СтрТЧ.ПРО=ложь;	
		
		ИмяРеквизита=ТекРеквизит.имя;
		СтрТЧ.ИмяРеквизита=ИмяРеквизита;
			
		если СостояниеДокумента =Перечисления.Отгружен.Отгружен тогда       
			если ТипДокумента="РасходнаяНакладная" тогда  //////////////////////////////////////Отгруженные РНК начало
				если ИмяРеквизита="ДатаПриемки" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="ДатаЗаказа" тогда	
				ИначеЕсли ИмяРеквизита="ДатаОплаты" тогда
					СтрТЧ.ЦО=истина;
				ИначеЕсли ИмяРеквизита="ДатаОтгрузки" тогда	
				ИначеЕсли ИмяРеквизита="Договор" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ПРО=Истина;
				ИначеЕсли ИмяРеквизита="Комментарий" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="Менеджер" тогда	
					СтрТЧ.ЦО=истина;
				ИначеЕсли ИмяРеквизита="НомерЗаказа" тогда
				ИначеЕсли ИмяРеквизита="Организация" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ПРО=Истина;
				ИначеЕсли ИмяРеквизита="ОтсрочкаПлатежа" тогда	
					СтрТЧ.ЦО=истина;
					//Кухарь 14.01.18 начало
					//Согласование ПРО тут не нужно
					//СтрТЧ.ПРО=Истина;
					//Кухарь 14.01.18 конец
				ИначеЕсли ИмяРеквизита="Подразделение" тогда	
					СтрТЧ.ЦО=истина;
				ИначеЕсли ИмяРеквизита="Контрагент" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ПРО=Истина;
				ИначеЕсли ИмяРеквизита="ПунктДоставки" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;
					СтрТЧ.ПРО=Истина;
				ИначеЕсли ИмяРеквизита="ПунктПерегруза" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;
					//Кухарь 14.01.18 начало
					//Согласование ПРО тут не нужно
					//СтрТЧ.ПРО=Истина;
					//Кухарь 14.01.18 конец
					
				ИначеЕсли ИмяРеквизита="СуммаДокумента" тогда	
				ИначеЕсли ИмяРеквизита="ТранспортнаяКомпания" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="ТипДоставки" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="АдресПерегруза" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="ВремяПерегруза" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;
					
				КонецЕсли;	                                       
				//////////////////////////////////////Отгруженные РНК конец
				
			ИначеЕсли ТипДокумента="Перемещение" тогда                 //////////////////////////////////////Отгруженные ПРМ Начало
				
				если ИмяРеквизита="ДатаПриемки" тогда
				ИначеЕсли ИмяРеквизита="ДатаЗаказа" тогда	
				ИначеЕсли ИмяРеквизита="ДатаОплаты" тогда
				ИначеЕсли ИмяРеквизита="ДатаОтгрузки" тогда							
				ИначеЕсли ИмяРеквизита="Договор" тогда	
				ИначеЕсли ИмяРеквизита="Комментарий" тогда
					СтрТЧ.ЦО=истина;				
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="Менеджер" тогда	
					СтрТЧ.ЦО=истина;
				ИначеЕсли ИмяРеквизита="НомерЗаказа" тогда
				ИначеЕсли ИмяРеквизита="Организация" тогда
					СтрТЧ.ЦО=истина;				
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="ОтсрочкаПлатежа" тогда	
				ИначеЕсли ИмяРеквизита="Подразделение" тогда	
				ИначеЕсли ИмяРеквизита="Контрагент" тогда
				ИначеЕсли ИмяРеквизита="ПунктДоставки" тогда			
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="ПунктПерегруза" тогда
					СтрТЧ.ЦО=истина;				
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="СуммаДокумента" тогда	
				ИначеЕсли ИмяРеквизита="ТранспортнаяКомпания" тогда
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="ТипДоставки" тогда	
				ИначеЕсли ИмяРеквизита="АдресПерегруза" тогда	
				ИначеЕсли ИмяРеквизита="ВремяПерегруза" тогда	
				КонецЕсли;	 	
				
				
			КонецЕсли;              
			//////////////////////////////////////Отгруженные ПРМ Конец
			
			
		Иначе
			если ТипДокумента="РасходнаяНакладная" тогда  //////////////////////////////////////резервные РНК начало
				если ИмяРеквизита="ДатаПриемки" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="ДатаЗаказа" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
					СтрТЧ.СК=Истина;			
				ИначеЕсли ИмяРеквизита="ДатаОтгрузки" тогда
					//Кухарь 29.05.19 начало
					//Для того чтобы ОВЛ могли менять дату отгрузки через коррекцию без менеджеров
					//СтрТЧ.ЦО=истина;				
					МенятьДатуОтгрузкиБезМенеджера=ложь;
					ЗапВРег=РегистрыСведений.РеквизитыСправочников.СоздатьНаборЗаписей();	
					ЗапВРег.Отбор.ИмяРеквизита.значение="МенятьДатуОтгрузкиБезМенеджера";
					ЗапВРег.Отбор.Справочник.значение=ДокОснование.Контрагент;
					ЗапВРег.Отбор.ИмяРеквизита.использование=Истина;
					ЗапВРег.Отбор.Справочник.использование=Истина;	
					ЗапВРег.Прочитать();
					для каждого СтрЗР из ЗапВРег цикл
						МенятьДатуОтгрузкиБезМенеджера=СтрЗР.ЗначениеРеквизита;
					КонецЦикла;	
					если МенятьДатуОтгрузкиБезМенеджера=Ложь тогда
						СтрТЧ.ЦО=истина;
					КонецЕсли;
					//Кухарь 29.05.19 конец
					
					
					//Кухарь 29.05.19 конец
					СтрТЧ.ОВЛ=Истина;
					СтрТЧ.СК=Истина;		
				ИначеЕсли ИмяРеквизита="ДатаОплаты" тогда
					//Кухарь 29.05.19 начало
					//Для того чтобы ОВЛ могли менять дату отгрузки через коррекцию без менеджеров
					//СтрТЧ.ЦО=истина;
					МенятьДатуОтгрузкиБезМенеджера=ложь;
					ЗапВРег=РегистрыСведений.РеквизитыСправочников.СоздатьНаборЗаписей();	
					ЗапВРег.Отбор.ИмяРеквизита.значение="МенятьДатуОтгрузкиБезМенеджера";
					ЗапВРег.Отбор.Справочник.значение=ДокОснование.Контрагент;
					ЗапВРег.Отбор.ИмяРеквизита.использование=Истина;
					ЗапВРег.Отбор.Справочник.использование=Истина;	
					ЗапВРег.Прочитать();
					для каждого СтрЗР из ЗапВРег цикл
						МенятьДатуОтгрузкиБезМенеджера=СтрЗР.ЗначениеРеквизита;
					КонецЦикла;						
					если МенятьДатуОтгрузкиБезМенеджера=Истина и Коррекция.ДатаОтгрузки<>Коррекция.ДатаОтгрузкиДоИзменения тогда
						СтрТЧ.ОВЛ=Истина;
					иначе
                        СтрТЧ.ЦО=Истина;
					КонецЕсли;					
					//Кухарь 29.05.19 конец

				ИначеЕсли ИмяРеквизита="Договор" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;	
				ИначеЕсли ИмяРеквизита="Комментарий" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.СК=Истина;	
				ИначеЕсли ИмяРеквизита="Менеджер" тогда	
					СтрТЧ.ЦО=истина;
				ИначеЕсли ИмяРеквизита="НомерЗаказа" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
					СтрТЧ.СК=Истина;						
				ИначеЕсли ИмяРеквизита="Организация" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;	
				ИначеЕсли ИмяРеквизита="ОтсрочкаПлатежа" тогда	
					СтрТЧ.ЦО=истина;
				ИначеЕсли ИмяРеквизита="Подразделение" тогда	
					СтрТЧ.ЦО=истина;
				ИначеЕсли ИмяРеквизита="Контрагент" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
					СтрТЧ.СК=Истина;	
				ИначеЕсли ИмяРеквизита="ПунктДоставки" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
					СтрТЧ.СК=Истина;	
				ИначеЕсли ИмяРеквизита="ПунктПерегруза" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="СуммаДокумента" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;				
				ИначеЕсли ИмяРеквизита="ТранспортнаяКомпания" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="ТипДоставки" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="АдресПерегруза" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="ВремяПерегруза" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;	
				КонецЕсли;                                           //////////////////////////////////////резервные РНК конец
				
			ИначеЕсли  ТипДокумента="Перемещение" тогда              //////////////////////////////////////резервные ПРМ начало
				если ИмяРеквизита="ДатаПриемки" тогда
				ИначеЕсли ИмяРеквизита="ДатаЗаказа" тогда		
				ИначеЕсли ИмяРеквизита="ДатаОплаты" тогда
				ИначеЕсли ИмяРеквизита="ДатаОтгрузки" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
					СтрТЧ.СК=Истина;						
				ИначеЕсли ИмяРеквизита="Договор" тогда	
				ИначеЕсли ИмяРеквизита="Комментарий" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
					СтрТЧ.СК=Истина;	
				ИначеЕсли ИмяРеквизита="Менеджер" тогда	
					СтрТЧ.ЦО=истина;
				ИначеЕсли ИмяРеквизита="НомерЗаказа" тогда				
				ИначеЕсли ИмяРеквизита="Организация" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="ОтсрочкаПлатежа" тогда	
				ИначеЕсли ИмяРеквизита="Подразделение" тогда	
				ИначеЕсли ИмяРеквизита="Контрагент" тогда
				ИначеЕсли ИмяРеквизита="ПунктДоставки" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
					СтрТЧ.СК=Истина;	
				ИначеЕсли ИмяРеквизита="ПунктПерегруза" тогда
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="СуммаДокумента" тогда	
					
				ИначеЕсли ИмяРеквизита="ТранспортнаяКомпания" тогда
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="ТипДоставки" тогда	
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="АдресПерегруза" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="ВремяПерегруза" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;
					
				КонецЕсли;                           //////////////////////////////////////резервные ПРМ конец
			ИначеЕсли   ТипДокумента="ПриходнаяНакладная" тогда     //////////////////////////////////////Все ПНК начало
				
				если ИмяРеквизита="ДатаПриемки" тогда
				ИначеЕсли ИмяРеквизита="ДатаЗаказа" тогда		
				ИначеЕсли ИмяРеквизита="ДатаОплаты" тогда
				ИначеЕсли ИмяРеквизита="ДатаОтгрузки" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
					СтрТЧ.СК=Истина;						
				ИначеЕсли ИмяРеквизита="Договор" тогда	
				ИначеЕсли ИмяРеквизита="Комментарий" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="Менеджер" тогда	
					//Кухарь 07.03.19 начало
					СтрТЧ.ЦО=истина;				
					//Кухарь 07.03.19 конец		
				ИначеЕсли ИмяРеквизита="НомерЗаказа" тогда				
				ИначеЕсли ИмяРеквизита="Организация" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="ОтсрочкаПлатежа" тогда	
				ИначеЕсли ИмяРеквизита="Подразделение" тогда	
					//Кухарь 07.03.19 начало
					СтрТЧ.ЦО=истина;				
					//Кухарь 07.03.19 конец							
				ИначеЕсли ИмяРеквизита="Контрагент" тогда
				ИначеЕсли ИмяРеквизита="ПунктДоставки" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="ПунктПерегруза" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="СуммаДокумента" тогда	
					
				ИначеЕсли ИмяРеквизита="ТранспортнаяКомпания" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="ТипДоставки" тогда	
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="АдресПерегруза" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="ВремяПерегруза" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=истина;			
				КонецЕсли; 	                                              //////////////////////////////////////Все ПНК конец
			ИначеЕсли   ТипДокумента="ЗаявкаВТранспортныйОтдел" тогда     //////////////////////////////////////Все ЗТО начало
				
				если ИмяРеквизита="ДатаПриемки" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
					СтрТЧ.СК=Истина;							
				ИначеЕсли ИмяРеквизита="ДатаЗаказа" тогда		
				ИначеЕсли ИмяРеквизита="ДатаОплаты" тогда
				ИначеЕсли ИмяРеквизита="ДатаОтгрузки" тогда	
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
					СтрТЧ.СК=Истина;						
				ИначеЕсли ИмяРеквизита="Договор" тогда	
				ИначеЕсли ИмяРеквизита="Комментарий" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
				ИначеЕсли ИмяРеквизита="Менеджер" тогда	
					СтрТЧ.ЦО=истина;					
				ИначеЕсли ИмяРеквизита="НомерЗаказа" тогда				
				ИначеЕсли ИмяРеквизита="Организация" тогда
				ИначеЕсли ИмяРеквизита="ОтсрочкаПлатежа" тогда	
				ИначеЕсли ИмяРеквизита="Подразделение" тогда	
					СтрТЧ.ЦО=истина;	
				ИначеЕсли ИмяРеквизита="Контрагент" тогда
				ИначеЕсли ИмяРеквизита="ПунктДоставки" тогда
				ИначеЕсли ИмяРеквизита="ПунктПерегруза" тогда
				ИначеЕсли ИмяРеквизита="СуммаДокумента" тогда	
					
				ИначеЕсли ИмяРеквизита="ТранспортнаяКомпания" тогда
				ИначеЕсли ИмяРеквизита="ТипДоставки" тогда	
					СтрТЧ.ОВЛ=истина;
				ИначеЕсли ИмяРеквизита="АдресПерегруза" тогда	
				ИначеЕсли ИмяРеквизита="ВремяПерегруза" тогда	
					//Кухарь 07.03.19 начало
				ИначеЕсли ИмяРеквизита="КоличествоДокумента" или ИмяРеквизита="КоличествоКоробок" тогда
					СтрТЧ.ЦО=истина;	
				ИначеЕсли ИмяРеквизита="Отправитель" или 
					ИмяРеквизита="ПунктДоставкиОтправитель" или 
					ИмяРеквизита="ТранспортнаяКомпанияОтправитель" или 
					ИмяРеквизита="ПунктПерегрузаОтправитель" или 
					ИмяРеквизита="ПунктДоставкиПолучатель" или 
					ИмяРеквизита="Содержание" или 					
					ИмяРеквизита="ТранспортнаяКомпанияПолучатель" тогда 
					
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
					
				ИначеЕсли ИмяРеквизита="Получатель" или ИмяРеквизита="Объем" тогда
					СтрТЧ.ЦО=истина;
					СтрТЧ.ОВЛ=Истина;
					СтрТЧ.СК=Истина;
				ИначеЕсли ИмяРеквизита="КоличествоКоробок" тогда
					СтрТЧ.ЦО=истина;
					//Кухарь 07.03.19 конец
				
					
				КонецЕсли; 	       //////////////////////////////////////Все ЗТО конец
				
			КонецЕсли;                                            
		КонецЕсли;			
	КонецЦикла;
	
	//Заполним табличную часть Согласования если она пустая
	если Согласования.Количество()=0 тогда
		МассСтрок=ТЗРаспределения.найтистроки(Новый Структура("ПРО",Истина));
		если МассСтрок.количество()>0 тогда
			СтрТЧ=Согласования.Добавить();
			СтрТЧ.Подразделение=Справочники.Подразделения.НайтиПоКоду("SSP-0145");  //Претензионно-ревизионный отдел
		КонецЕсли;	
		
		МассСтрок=ТЗРаспределения.найтистроки(Новый Структура("ЦО",Истина));
		если МассСтрок.количество()>0 тогда
			СтрТЧ=Согласования.Добавить();
			СтрТЧ.Подразделение=Справочники.Подразделения.НайтиПоКоду("SSP-0001");  //ЦО (Управление)
		КонецЕсли;	
		
		МассСтрок=ТЗРаспределения.найтистроки(Новый Структура("ОВЛ",Истина));
		если МассСтрок.количество()>0 тогда
			СтрТЧ=Согласования.Добавить();
			СтрТЧ.Подразделение=Справочники.Подразделения.НайтиПоКоду("SMN-0434");  //ОВЛ
		КонецЕсли;	
		
		МассСтрок=ТЗРаспределения.найтистроки(Новый Структура("СК",Истина));
		если МассСтрок.количество()>0 тогда
			СтрТЧ=Согласования.Добавить();
			СтрТЧ.Подразделение=Справочники.Подразделения.НайтиПоКоду("SMN-0436");  //Складской Комплекс Общие
		КонецЕсли;	
				
	КонецЕсли;
	
	
	Возврат ТЗРаспределения;	
КонецФункции
